openFoamRepoDev/tutorials/multiphase/interFoam/RAS/damBreakPorousBaffle/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    rightWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    lowerWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }

    porous_half0
    {
        type            porousBafflePressure;
        patchType       cyclic;
        D               1000;
        I               500;
        length          0.15;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }

    porous_half1
    {
        type            porousBafflePressure;
        patchType       cyclic;
        D               1000;
        I               500;
        length          0.15;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
